# PartMakerSplitterProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PartMakerSplitterProfile Property
ParameterTypeId Class See Also
---
"Division Profile"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PartMakerSplitterProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartMakerSplitterProfile As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PartMakerSplitterProfile {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace